; Русский языковой файл v3.9.1
; Автор: bursoft
; В ключе codepage должен быть указан номер кодовой страницы для этого языка (напр. 1251 для русского, 1253 для греческого и т.д.).
bat_lang=ru
codepage=1251
error=ОШИБКА^!
startup_error1=Batch ApkTool не имеет полного доступа к папке, или путь установки содержит недопустимые символы
startup_error2=Batch ApkTool не имеет разрешения на запись в папку
previous_java1=У вас установлена Java
previous_java2=Для корректной работы Batch ApkTool требуется Java 8 или выше
get_java=Скачать последнюю версию Java можно здесь https://www.java.com/ru/download/
java_notfound=Java не найдена
ON=ДА
OFF=НЕТ
MANUAL=ВРУЧНУЮ
project=Текущий проект                              
currentapk=Выбранный APK                               
currentjar=Выбранный JAR                               
apilevel=уровень API                               
keepbroken=оставить поврежденные ресурсы             
buildexpert=собирать в экспертном режиме                                         
dontwritedebug=Удалить отладочную информацию из smali-кода 
signafter=Подписать результирующий APK                
key=ключ для подписи                          
openlog=Открыть лог                                                           
language=Язык                                        
deodexall=Деодексировать все APK и JAR                
copy_deodexed_apk=Скопировать деодекс. APK в _INPUT_APK       
copy_deodexed_jar=Скопировать деодекс. JAR в _INPUT_JAR       
baksmaliapk=Декомпилировать APK (только smali)
smaliapk=Рекомпилировать APK
baksmalijar=Декомпилировать JAR (только smali)
smalijar=Рекомпилировать JAR
decompile=Декомпилировать APK                         
decompile_r=Декомпилировать APK (только ресурсы)        
recompile=Рекомпилировать APK                         
signfiles=Подписать файлы
zipalfiles=Выравнять файлы
viewsource=Показать исходный код Java
plugins=Плагины >
selplugin=ВЫБЕРИТЕ ПЛАГИН:
adbmenu=ADB:
devices=Подключение устройства                      
install=Установить APK >                            
rootremount=Режим root, монтирование для записи         
pull=Скопировать с устройства >                  
push=Скопировать на устройство >                 
screenshot=Сделать снимок экрана                       
screenrecord=Записать видео с экрана
shell=Открыть терминал
logs=Показать логи >
reboot=Перезагрузить устройство >
info=Информация об устройстве
kill-server=Завершить работу ADB
servicemenu=ОБСЛУЖИВАНИЕ:
cleanup1=Очистить папки _framework, _system          
cleanup2=Очистить папки _INPUT_APK, _INPUT_JAR       
cleanup3=Очистить папки _OUT_APK, _OUT_JAR
cleanup4=Очистить ВСЕ папки
exitmenu=ВЫХОД
choosetask=ВЫБЕРИТЕ ДЕЙСТВИЕ:
instframe=Установка фреймворка
instframe_error=Ошибка установки фреймворка
inputapk_empty=Поместите файлы для декомпиляции в папку _INPUT_APK. Подробности смотрите в readme.txt.
decompiling=Декомпиляция
decompiling_error=Ошибка декомпиляции
recompiling=Рекомпиляция
recompiling_error=Ошибка рекомпиляции
orignotfound=ОШИБКА^! Оригинальный файл не найден.
backupnotfound=ОШИБКА^! Папка _backup не найдена.
done=ГОТОВО
signing=Подпись
signing_error=Ошибка подписи
doneerrors=ГОТОВО с ^!error_count^! ОШИБКАМИ.
zipal=Выравнивание
zipal_error=Ошибка выравнивания
selectviewer=Просмотрщик исходного кода Java:
cancel=ОТМЕНА
makechoice=Сделайте выбор:
dragajd=перетащите APK, JAR или DEX-файл сюда:
genjava=Генерация Java-кода из
genjava_error=Ошибка генерации Java-кода из
apilevel_log=Уровень API                 
buildexpert_log=Экспертный режим            
signafter_log=Подпись                     
press1=Нажмите ENTER для продолжения или введите 1, чтобы открыть лог:
deletedialog=Удаление всех файлов в папках:
proceed=Продолжить?
yes=ДА
selproj=ВЫБЕРИТЕ ПРОЕКТ:
createnewproj=Создать новый проект
usedefproj=Использовать проект по умолчанию
inputprojname=Введите название проекта:
selectapk=ВЫБЕРИТЕ APK:
allapks=Все APK в _INPUT_APK
selectjar=ВЫБЕРИТЕ JAR:
alljars=Все JAR в _INPUT_JAR
selectapktool=ВЫБЕРИТЕ APKTOOL:
selectsmali=ВЫБЕРИТЕ SMALI:
aversions=Версия Android
apilevels=Уровень API    
enterapi=Введите уровень API:
invalidapi=Неверный уровень API^!
selectkey=ВЫБЕРИТЕ КЛЮЧ:
selectlang=ВЫБЕРИТЕ ЯЗЫК:
framework_empty=Поместите все фреймворки в папку _system\framework. Подробности смотрите в readme.txt.
deodexing=Деодексация
notodexed=Файл не одексирован.
smerror=Ошибка рекомпиляции (smali)
bsmerror=Ошибка декомпиляции (smali)
bootnotfound=boot.oat не найден
selectarch=ВЫБЕРИТЕ АРХИТЕКТУРУ boot.oat:
selectedarch=Архитектура
extractboot=Распаковка и деодексация boot.oat...
extractboot_error=Ошибка распаковки boot.oat
errorunp=Ошибка распаковки
deodexing_error=Ошибка деодексации
baksmaling=Декомпиляция (smali)
smaling=Рекомпиляция (smali)
connection_type=Тип соединения:
input_ip=Введите IP и порт устройства, например 192.168.1.3:40404:
input_ip2=Введите IP или нажмите ENTER, чтобы использовать последний IP
installtodef=Установить в память устройства:
singlefile=Один файл
allfrom=Все файлы из
installtosd=Установить на SD-карту:
dragtoinstall=Перетащите сюда APK для установки:
installing=Установка
pull2=Скопировать с устройства:
pushto=Скопировать в
dragtopush=Перетащите сюда файл для копирования:
screensavedto=Снимок экрана сохранён в файл
closetostop=Закройте это окно, чтобы остановить запись
scrrecsavedto=Запись с экрана сохранена в файл
logcatr=радио
logcate=события
toscreen=показать и сохранить в файл
tofile=Сохранить в файл
bugreport=Полный отчет:
inlinetable=Таблица inline-методов:
saved_to_file=Лог сохранен в файл
android_version=Версия Android:
brand=Марка:
model=Модель:
reboot2=Перезагрузка:
reboot3=Перезагрузить
rebootto=Перезагрузить в
symlinks=СИМВОЛЬНЫЕ ССЫЛКИ
copied_files=Скопировано файлов:
old_smali_used=Для деодексации выберите smali 2.2 или выше
already_deodexed=Файл уже деодексирован.
onefrom=Один файл из
alt_method=альтернативный метод
tool_for_deodex=Утилита для деодексации Android 6.x-7.x                               
del_symlinks=Удалять симлинки после деодексации                                    
rewrite_opt=Предупреждать о перезаписи папки при декомпиляции                     
warn_rewrite1=Обнаружена папка с декомпилированным приложением
warn_rewrite2=Введите 1 для перезаписи папки, или нажмите ENTER для отмены:
sound_opt=Звуковые оповещения                                                   
manifest_opt=Сохранять оригинальный AndroidManifest.xml                            
AUTO=АВТО
AUTO+=АВТО+
necessary_files_missing=Дальнейшая работа Batch ApkTool невозможна, так как отсутствуют один или несколько необходимых для работы файлов
dex_notfound=Файл не содержит classes.dex, он должен быть деодексирован перед декомпиляцией.
elapsed_time=Затрачено времени
elapsed_h=ч.
elapsed_m=мин.
elapsed_s=сек.
tool_for_deodex_vdex=Утилита для деодексации Android 8.x                                   
device_warning=Для деодексации Android 9.x необходимо подключить устройство\эмулятор через ADB. Подключите его (пункт меню [10]) и снова запустите деодексацию.
signing_scheme_opt=Схема подписи APK                                                     
use_aapt_2=Версия AAPT (только для apktool v2.x)                                  
back_to_main_menu=Вернуться в главное меню
set_postfix=Добавлять порядковый номер к имени выходного файла, вместо перезаписи 
dex_compression=Уровень сжатия .dex-файлов                                             
dex_compression_text=Введите уровень сжатия (0 - без сжатия, 9 - макс. сжатие)
res_mode=режим обработки ресурсов                  
force_sign_v1=Принудительно добавлять подпись v1                                    
produce_v4_sign=Дополнительно создавать файл подписи v4 (.idsig)                      
enable_expert_mode=Активировать экспертный режим                                          
expert_mode_disabled=Экспертный режим деактивирован
input_ip3=Выберите подключение или введите IP и порт
devices_not_found=ADB устройства не найдены
adbcontrol=Управление устройством                      
pullfrom=Скопировать из
push2=Скопировать на устройство
current_folder=Текущая папка
connect_qr=Подключить через QR-код
merge_apks=Объединить split APK                        
merging=Объединение
adbfilemanager=Файловый менеджер >                         
adbpm=Диспетчер приложений >                      
adbpkg=Управление приложениями
pkgall=Показать ВСЕ пакеты
pkgsys=Показать СИСТЕМНЫЕ пакеты
pkgusr=Показать ПОЛЬЗОВАТЕЛЬСКИЕ пакеты
pkgdis=Показать ОТКЛЮЧЕННЫЕ пакеты
pkgdel=Показать УДАЛЁННЫЕ пакеты
pkglist=Загрузить список пакетов из файла